# 1️⃣ Create DB

In [1]:
import sqlite3

# Connect / create db
conn = sqlite3.connect("fleet01.db")
cursor = conn.cursor()

# drop table if it exists
cursor.execute("DROP TABLE IF EXISTS fuel_usage")
cursor.execute("DROP TABLE IF EXISTS vehicles")

# Create vehicles table
cursor.execute("""
CREATE TABLE vehicles (
    vehicle_id INTEGER PRIMARY KEY,
    type TEXT,
    plate TEXT,
    brand TEXT,
    region TEXT
)
""")

# Create fuel_usage table
cursor.execute("""
CREATE TABLE fuel_usage (
    record_id INTEGER PRIMARY KEY,
    vehicle_id INTEGER,
    month TEXT,
    fuel_cost REAL,
    km_driven REAL,
    fuel_type TEXT,
    FOREIGN KEY(vehicle_id) REFERENCES vehicles(vehicle_id)
)
""")

conn.commit()
conn.close()

# 2️⃣Imports + Connect

In [2]:
import sqlite3
import pandas as pd

# Connect to db
conn = sqlite3.connect("fleet01.db")

# SELECT tables
pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", conn)

         name
0    vehicles
1  fuel_usage

# 3️⃣ Insert Fake Data - Vehicles

In [3]:
import sqlite3
import random

conn = sqlite3.connect("fleet01.db")
cursor = conn.cursor()

# -----------------------------
# FAKE VEHICLES
vehicle_types = ["Car", "Van", "Truck"]
brands = ["Toyota", "Ford", "VW", "Volvo", "Renault", "Skoda"]
regions = ["Athens", "Thessaloniki", "Patras", "Heraklion"]

num_vehicles = 100
vehicles_data = []

for i in range(1, num_vehicles + 1):
    vehicles_data.append((
        i,
        random.choice(vehicle_types),
        f"XYZ-{1000+i}",
        random.choice(brands),
        random.choice(regions)
    ))

cursor.executemany(
    "INSERT INTO vehicles (vehicle_id, type, plate, brand, region) VALUES (?, ?, ?, ?, ?);",
    vehicles_data
)

# -----------------------------
# FAKE FUEL USAGE
months = ["2025-09", "2025-10", "2025-11", "2025-12", "2026-01"]
fuel_records = []
record_id = 1

for vehicle_id in range(1, num_vehicles + 1):
    for month in months:
        fuel_type = "Diesel" if random.random() > 0.5 else "Petrol"  # 50 - 50
        km = random.randint(700, 3000)
        fuel_cost = round(random.uniform(100, 500), 2)

        fuel_records.append((
            record_id,
            vehicle_id,
            month,
            fuel_cost,
            km,
            fuel_type
        ))
        record_id += 1

cursor.executemany(
    "INSERT INTO fuel_usage (record_id, vehicle_id, month, fuel_cost, km_driven, fuel_type) VALUES (?, ?, ?, ?, ?, ?);",
    fuel_records
)

conn.commit()

Fake data inserted successfully (50-50 fuel type)

# 4️⃣Check inserted data

In [6]:
import sqlite3

# Re-open the database connection
conn = sqlite3.connect("fleet01.db")

In [5]:
import pandas as pd
# Show the first 5 rows of the vehicles table
pd.read_sql("SELECT * FROM vehicles LIMIT 5;", conn)

# Show the first 5 rows of the fuel_usage table
pd.read_sql("SELECT * FROM fuel_usage LIMIT 5;", conn)

   record_id  vehicle_id    month  fuel_cost  km_driven fuel_type
0          1           1  2025-09     157.72     2427.0    Diesel
1          2           1  2025-10     142.69      955.0    Petrol
2          3           1  2025-11     456.33     2734.0    Petrol
3          4           1  2025-12     288.56     1154.0    Diesel
4          5           1  2026-01     406.23      799.0    Diesel